app/controllers/addresses_controller.rb

SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 1
---
  def index
    @addresses = @user.addresses.all

UPDATE `addresses` SET `addresses`.`current` = 0
INSERT INTO `addresses` (`street_1`, `street_2`, `city`, `state`, `zip_code`, `current`, `type_address`, `user_id`, `created_at`, `updated_at`) VALUES ('10222 Currant Drive', '', 'Chicago', 'IL', '48872', 1, 1, 1, '2016-06-01 01:52:04', '2016-06-01 01:52:04')
---
  def create
    address = Address.new(address_params)
    if address.current == 1
      intTypeAddress = address.type_address == 'work' ? 1 : 0
      Address.where('type_address = ? AND id <> ?', intTypeAddress, params[:id]).update_all( current: 0)
    end
    @address = @user.addresses.new(address_params)
    if @address.save!

UPDATE `addresses` SET `current` = 1, `updated_at` = '2016-06-03 01:09:17' WHERE `addresses`.`id` = 12
---
  def update
    address = Address.new(address_params)
    if address.current == 1
      intTypeAddress = address.type_address == 'work' ? 1 : 0
      Address.where('type_address = ? AND id <> ?', intTypeAddress, params[:id]).update_all(current: 0)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
    def set_user
      @user = User.find(params[:user_id])

SELECT  `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 3 AND `addresses`.`id` = 12 LIMIT 1
---
    def set_address
      @address = @user.addresses.find(params[:id])