app/controllers/users_controller.rb

UPDATE `users` SET `last_name` = 'Edward', `updated_at` = '2016-04-28 00:20:11' WHERE `users`.`id` = 1
---
  def update
    @user.update(user_params)

INSERT INTO `users` (`first_name`, `last_name`, `ssi`, `created_at`, `updated_at`) VALUES ('Jonathan', 'Bateman', '122-44-5555', '2016-04-21 22:29:32', '2016-04-21 22:29:32')
---
  def create
    @user = User.new(user_params)
    if @user.save

DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    @user.destroy

SELECT `users`.* FROM `users`
---
  def index
    @users = User.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    def set_user
      @user = User.find(params[:id])